src/Catalogs/ИТ_ПараметрыСоединений.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Catalog>
		<Properties>
			<Name>ИТ_ПараметрыСоединений</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Ключ</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ПараметрыСоединения</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ИмяПараметра</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
								<v8:Type>xs:string</v8:Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
								<v8:StringQualifiers>
									<v8:Length>250</v8:Length>
								</v8:StringQualifiers>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/Catalogs/ИТ_ПараметрыСоединений/Ext/ManagerModule.bsl
Функция ПолучитьПараметрыПоКлючу(Ключ) Экспорт 
	
	ПараметрыСоединения = ПолучитьСсылкуПоКлючу(Ключ);
	
	Если ПараметрыСоединения = Неопределено Тогда 
		Возврат Неопределено;
	Иначе 
		Возврат ПолучитьПараметрыПоСсылке(ПараметрыСоединения);
	КонецЕсли;	
		
КонецФункции

Функция ПолучитьСсылкуПоКлючу(Ключ) Экспорт 
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ИТ_ПараметрыСоединений.Ссылка КАК ПараметрыСоединения
		|ИЗ
		|	Справочник.ИТ_ПараметрыСоединений КАК ИТ_ПараметрыСоединений
		|ГДЕ
		|	ИТ_ПараметрыСоединений.Ключ = &Ключ";
	Запрос.УстановитьПараметр("Ключ", Ключ);
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда 
		Возврат Выборка.ПараметрыСоединения;
	Иначе
		Возврат Неопределено;
	КонецЕсли;	
	
КонецФункции	

Функция ПолучитьПараметрыПоСсылке(ПараметрыСоединения) Экспорт 
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ИТ_ПараметрыСоединенийПараметрыСоединения.ИмяПараметра,
		|	ИТ_ПараметрыСоединенийПараметрыСоединения.Значение
		|ИЗ
		|	Справочник.ИТ_ПараметрыСоединений.ПараметрыСоединения КАК ИТ_ПараметрыСоединенийПараметрыСоединения
		|ГДЕ
		|	ИТ_ПараметрыСоединенийПараметрыСоединения.Ссылка = &ПараметрыСоединения";
	Запрос.УстановитьПараметр("ПараметрыСоединения", ПараметрыСоединения);
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Количество() = 0 Тогда 
		Возврат Неопределено;
	Иначе
		СтруктураПараметров = Новый Структура();
		
		Пока Выборка.Следующий() Цикл 
			СтруктураПараметров.Вставить(СтрЗаменить(СокрЛП(Выборка.ИмяПараметра), " ", ""), Выборка.Значение);
		КонецЦикла;	
		
		Возврат СтруктураПараметров;
	КонецЕсли;
	
КонецФункции
